mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	if (i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCCNT,
	    &pac_acccnt, sizeof(pac_acccnt)) != sizeof(pac_acccnt)) {
		printf("read pac_acccnt fail\n");
		pac_acccnt.acccnt_count = 0;
		return;
	} 
	printf("\n %d count %lu", NCANOK, pac_acccnt.acccnt_count);
	l600_current_count += pac_acccnt.acccnt_count;

	for (c = 0; c < 4; c++) {
		if ((pac_ctrl.ctrl_chan_dis & (8 >> c)) != 0)
			continue;

		acc_value = 0;
		if (i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCV1 + c,
		    &acc_value, 7) != 7) {
			printf("read acc_value[%d] fail\n", c);
			continue;
		}
		if (acc_value & 0x0080000000000000) {
			/* adjust negative value */
			acc_value |= 0xff00000000000000;
		}
		l600_current_acc[c] += acc_value;
		/* batt_i = acc_value * 0.00075 * 100 */
		v = (double)acc_value * 0.075 / pac_acccnt.acccnt_count;
		/* adjust with calibration data */
		switch(c) {
		case 0:
			v = v * 0.988689144013892;
			break;
		case 1:
			v = v * 1.00930129713152;
			break;
		case 2:
			v = v * 4.06331342566096;
			break;
		}
		batt_i[c] = v + 0.5;
		printf(" %d %4.4fA", c, v / 100);
		/* volt = vbus * 0.000488 */
		/* batt_v = voltages_acc * 0.000488 * 100 / 10; */
		/* adjust by 0.99955132 from calibration data */
		v = (double)voltages_acc[c] * 0.0048778104;
		batt_v[c] = v + 0.5;
		printf(" %4.3fV", v / 100);
	}
}

/* i2c OLED specific */
static char
i2c_writecontrol(const char address, char c)
{
	return i2c_writereg(address, 0, &c, 1);
}

static char
i2c_writedata(const char address, uint8_t len)
{
	return i2c_writereg(address, 0x40, &i2c_buf[0], len);
}

int
main(void)
{
	char c;
	uint16_t l;
	uint8_t i2cr;
	pac_accumcfg_t pac_accumcfg;
	pac_neg_pwr_fsr_t pac_neg_pwr_fsr;
	static unsigned int poll_count;
	uint16_t t0;
	static int32_t voltages_acc_cur[4];
	uint8_t new_boot;


	devid = 0;
	revid = 0;
	nmea2000_user_id = 0;
	/* read devid and user IDs */
	TBLPTR = 0x200000;
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id;");
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id + 1;");
	TBLPTR = 0x3ffffc;
	asm("tblrd*+;");
	asm("movff TABLAT, _revid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _revid + 1;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid + 1;");

	/* disable unused modules */
	PMD0 = 0x7a; /* keep clock and IOC */
#ifdef USE_TIMER2
	PMD1 = 0xfa; /* keep timer0/timer2 */
	PMD2 = 0x03; /* keep can module */
#else
	PMD1 = 0xfe; /* keep timer0 */
	PMD2 = 0x02; /* keep can module, TU16A */
#endif
	PMD3 = 0xdf; /* keep ADC */
	PMD4 = 0xff;
	PMD5 = 0xff;
	PMD6 = 0xf6; /* keep UART1 and I2C */
	PMD7 = 0xff;
	PMD8 = 0xff;

	ANSELC = 0;

	ANSELB = 0;
	/* CANRX on RB3 */
	CANRXPPS = 0x0B;
	/* CANTX on RB2 */
	LATBbits.LATB2 = 1; /* output value when idle */
	TRISBbits.TRISB2 = 0;
	RB2PPS = 0x46;

	ANSELA = 0x2e; /* RA1, RA2, RA3 and RA5 analog */
	LATA = 0;
	OLED_RSTN = 0;
	NDOWN = 0;
	TRISAbits.TRISA4 = 0; /* RA4/OLED_RSTN as outpout */
	TRISBbits.TRISB5 = 0; /* RB5/OLED_RSTN as outpout XXX */
	TRISCbits.TRISC0 = TRISCbits.TRISC1 = 0; /* RC0/RC1 as outpout XXX LED */
	TRISCbits.TRISC7 = 0; /* RC7/NDOWN output */
	LEDBATT_R = 1;
	LEDBATT_G = 0;

	/* configure watchdog timer for 2s */
	WDTCON0 = 0x16;
	WDTCON1 = 0x07;

	/* configure sleep mode: PRI_IDLE */
	CPUDOZE = 0x80;

	softintrs.byte = 0;
	counter_10hz = 25;
	counter_1hz = 10;
	seconds = 0;

	for (c = 0; c < 4; c++) {
		voltages_acc_cur[c] = 0;
		l600_current_acc[c] = 0;
		l600_voltages_acc[c] = 0;
	}
	l600_current_count = 0;

	IPR1 = 0;
	IPR2 = 0;
	IPR3 = 0;
	IPR4 = 0;
	IPR5 = 0;
	IPR6 = 0;
	IPR7 = 0;
	IPR8 = 0;
	IPR9 = 0;
	IPR10 = 0;
	IPR11 = 0;
	IPR12 = 0;
	IPR13 = 0;
	IPR14 = 0;
	IPR15 = 0;
	INTCON0 = 0;
	INTCON1 = 0;
	INTCON0bits.IPEN=1; /* enable interrupt priority */

	USART_INIT(0);

	/* configure timer0 as free-running counter at 9.765625Khz * 4 */
	T0CON0 = 0x0;
	T0CON0bits.MD16 = 1; /* 16 bits */
	T0CON1 = 0x48; /* 01001000 Fosc/4, sync, 1/256 prescale */
	PIR3bits.TMR0IF = 0;
	PIE3bits.TMR0IE = 0; /* no interrupt */
	T0CON0bits.T0EN = 1;

#ifdef USE_TIMER2
	/* configure timer2 for 250Hz interrupt */
	T2CON = 0x44; /* b01000100: postscaller 1/5, prescaler 1/16 */
	T2PR = 125; /* 250hz output */
	T2CLKCON = 0x01; /* Fosc / 4 */
	T2CONbits.TMR2ON = 1;
	PIR3bits.TMR2IF = 0;
	IPR3bits.TMR2IP = 1; /* high priority interrupt */
	PIE3bits.TMR2IE = 1;
#else
	/* configure UTMR for 10Hz interrupt */
	TU16ACON0 = 0x04; /* period match IE */
	TU16ACON1 = 0x00;
	TU16AHLT = 0x00; /* can't use hardware reset because of HW bug */
	TU16APS = 249; /* prescaler = 250 -> 40000 Hz */
	TU16APRH = (4000 >> 8) & 0xff;
	TU16APRL = 4000 & 0xff;
	TU16ACLK = 0x2; /* Fosc */
	TUCHAIN = 0;
	TU16ACON0bits.ON = 1;
	TU16ACON1bits.CLR = 1;
	IPR0bits.TU16AIP = 1; /* high priority interrupt */
	PIE0bits.TU16AIE = 1;
#endif

	I2C_INIT;

	INTCON0bits.GIEH=1;  /* enable high-priority interrupts */   
	INTCON0bits.GIEL=1; /* enable low-priority interrrupts */   

	printf("hello user_id 0x%lx devid 0x%x revid 0x%x\n", nmea2000_user_id, devid, revid);

	printf("n2k_init\n");
	nmea2000_init();
	poll_count = timer0_read();

	/* enable watchdog */
	WDTCON0bits.SEN = 1;

	/* set up ADC */
	PIR1bits.ADIF = 0;
	ADCON0 = 0x4; /* right-justified */
	ADCON1 = 0; /* no cap */
	ADCON2 = 0; /* basic mode */
	ADCON3 = 0; /* basic mode */
	ADCLK = 7; /* Fosc/16 */
	ADREF = 0;  /* vref = VDD */
	ADPCH = 0; /* channel 0 */
	ADACQH = 0;
	ADACQL = 20; /* 20Tad Aq */
	// USEADC ADCON0bits.ADON = 1;

	printf("display init");
	/* setup OLED */
	for (l = 0; l < 1000; l++)    
		CLRWDT();
	OLED_RSTN = 1;
	for (l = 0; l < 1000; l++)    
		CLRWDT();
	printf(" 1");

	/* command lock */
	OLED_CTRL(0xfd); OLED_CTRL(0x12);
	CLRWDT();

	/* display off */
	OLED_CTRL(0xae);
	CLRWDT();

	/* set freq */
	OLED_CTRL(0xd5); OLED_CTRL(0xa0);
	CLRWDT();
	/* set multiplexer */
	OLED_CTRL(0xa8); OLED_CTRL(0x3f);
	CLRWDT();
	/* display offset */
	OLED_CTRL(0xd3); OLED_CTRL(0x00);
	CLRWDT();
	/* start line */
	OLED_CTRL(0x40);
	CLRWDT();
	/* segment remap */
	OLED_CTRL(0xa0);
	CLRWDT();
	/* com output scan direction */
	OLED_CTRL(0xc0);
	CLRWDT();
	/* com pin hardware config */
	OLED_CTRL(0xda); OLED_CTRL(0x12);
	CLRWDT();
	/* current control */
	// OLED_CTRL(0x81); OLED_CTRL(0xdf);
	OLED_CTRL(0x81); OLED_CTRL(bright);
	CLRWDT();
	/* pre-charge period */
	OLED_CTRL(0xd9); OLED_CTRL(0x82);
	CLRWDT();
	/* vcomh deselect level */
	OLED_CTRL(0xdb); OLED_CTRL(0x34);
	CLRWDT();
	/* entire display on/off */
	OLED_CTRL(0xa4);
	CLRWDT();
	/* normal/inverse */
	OLED_CTRL(0xa6);
	CLRWDT();
	/* clear RAM */
	OLED_CTRL(0x20); OLED_CTRL(0x00); /* page addressing mode */
	OLED_CTRL(0x21); OLED_CTRL(0x00); OLED_CTRL(0x7f); /*column start/end */
	OLED_CTRL(0x22); OLED_CTRL(0x00); OLED_CTRL(0x07); /*page start/end */
	OLED_CTRL(0x00); OLED_CTRL(0x10);  /* column start */
	OLED_CTRL(0xb0); /* page start */
	CLRWDT();
	memset(i2c_buf, 0, I2C_BUFSZ);
	printf(" buf size %d", (int)I2C_BUFSZ);
	i2c_buf[0] = 0x1;

