mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	for (l = 0; l < OLED_DISPLAY_SIZE; l += I2C_BUFSZ) {
		OLED_DATA(I2C_BUFSZ);
		i2c_buf[0] = 0x0;
		CLRWDT();
	}
	/* set display on */
	OLED_CTRL(0xaf);
	CLRWDT();
	printf(" done\n");

	NDOWN = 1;
	/* wait 50ms for pac1953 to be up */
	for (c = 0; c < 50; c++) {
		t0 = timer0_read();
		while (timer0_read() - t0 < TIMER0_1MS) {
			; /* wait */
		}
	}

#ifdef USELOG
#if 0
	log_erase();
#endif

	/* look for current block */
	printf("blocks");
	for (c = 0; c < LOG_BLOCKS; c++) {
		printf(" 0x%x", battlog[c].b_flags);
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_PART) {
			/* found it */
			log_cblk = c;
			log_gen = battlog[c].b_flags & B_FILL_GEN;
			break;
		}
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_FULL) {
			uint8_t c2 = (c + 1) & LOG_BLOCKS_MASK;
			if ((battlog[c2].b_flags & B_FILL_STAT)
			    == B_FILL_FREE) {
				/* stopped just at boundary */
				log_cblk = c2;
				log_gen = battlog[c].b_flags & B_FILL_GEN;
				if (log_cblk == 0)
					log_gen += 0x4;
				break;
			}
		}
	}
	printf("\n");
	if (c == LOG_BLOCKS) {
		/* log empty, start a 0 */
		printf("log empty\n");
		log_cblk = 0;
		log_gen = 0;
	}
	/* look for first free entry in block */
	for (c = 0; c < LOG_ENTRIES; c++) {
		if (battlog[log_cblk].b_entry[c].s.nvalid == 1) {
			/* first free entry */
			log_centry = c;
			break;
		}
	}
	if (c == LOG_ENTRIES) {
		/* log corrupted, reset */
		printf("non-full block with no free entry: reset log\n");
		log_erase();
	}
	page_read(&battlog[log_cblk]);

	memset(&curlog.b_entry[log_centry], 0, sizeof(union log_entry));

	next_log_entry();
#endif /* USELOG */

again:
	c = 0;
	if (i2c_readreg(PAC_I2C_ADDR, PAC_PRODUCT, &i2cr, 1) != 1)
		c++;
	else 
		printf("product id 0x%x ", i2cr);

	if (i2c_readreg(PAC_I2C_ADDR, PAC_MANUF, &i2cr, 1) != 1)
		c++;
	else
		printf("manuf id 0x%x ", i2cr);

	if (i2c_readreg(PAC_I2C_ADDR, PAC_REV, &i2cr, 1) != 1)
		c++;
	else
		printf("rev id 0x%x\n", i2cr);

	if (i2c_readreg(PAC_I2C_ADDR,
	    PAC_CTRL_ACT, (uint8_t *)&pac_ctrl, sizeof(pac_ctrl)) !=
	    sizeof(pac_ctrl))
		c++;
	else {
		printf("CTRL_ACT al1 %d al2 %d mode %d dis %d\n",
		    pac_ctrl.ctrl_alert1,
		    pac_ctrl.ctrl_alert2,
		    pac_ctrl.ctrl_mode,
		    pac_ctrl.ctrl_chan_dis);
	}

#ifdef USEPAC
	pac_ctrl.ctrl_alert1 = pac_ctrl.ctrl_alert2 = CTRL_ALERT_ALERT;
	pac_ctrl.ctrl_mode = CTRL_MODE_1024;

	if (i2c_writereg(PAC_I2C_ADDR,
	    PAC_CTRL, (uint8_t *)&pac_ctrl, sizeof(pac_ctrl)) == 0) {
		printf("wr PAC_CTRL fail\n");
		c++;
	}

	pac_accumcfg.accumcfg_acc1 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc2 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc3 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc4 = ACCUMCFG_VSENSE;
	if (i2c_writereg(PAC_I2C_ADDR,
	    PAC_ACCUMCFG, (uint8_t *)&pac_accumcfg, sizeof(pac_accumcfg)) == 0) {
		printf("wr PAC_ACCUMCFG fail\n");
		c++;
	}

	pac_neg_pwr_fsr.pwrfsr_vb1 = pac_neg_pwr_fsr.pwrfsr_vs1 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb2 = pac_neg_pwr_fsr.pwrfsr_vs2 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb3 = pac_neg_pwr_fsr.pwrfsr_vs3 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vb4 = pac_neg_pwr_fsr.pwrfsr_vs4 = PAC_PWRSFR_BHALF;
	if (i2c_writereg(PAC_I2C_ADDR,
	    PAC_NEG_PWR_FSR, (uint8_t *)&pac_neg_pwr_fsr,
	    sizeof(pac_neg_pwr_fsr)) == 0) {
		printf("wr PAC_NEG_PWR_FSR fail\n");
		c++;
	}

	if (i2c_writecmd(PAC_I2C_ADDR, PAC_REFRESH) == 0) {
		printf("cmd PAC_REFRESH fail\n");
		c++;
	}
	if (c != 0)
		goto again;
#endif /* USEPAC */

	while (1) {
		CLRWDT();
		if (C1INTLbits.RXIF) {
			nmea2000_receive();
		}
		if (NCANOK) {
			nmea2000_status = NMEA2000_S_ABORT;
			poll_count = timer0_read();;
		} else if (nmea2000_status != NMEA2000_S_OK) {
			uint16_t ticks, tmrv;

			tmrv = timer0_read();
			ticks = tmrv - poll_count;
			if (ticks > TIMER0_5MS) {
				poll_count = tmrv;
				nmea2000_poll(ticks / TIMER0_1MS);
			}
			if (nmea2000_status == NMEA2000_S_OK) {
				printf("new addr %d\n", nmea2000_addr);
			}
		}
#ifdef USEADC
		if (PIR1bits.ADIF) {
			PIR1bits.ADIF = 0;
			a2d_acc = ((unsigned int)ADRESH << 8) | ADRESL;
			switch (ADPCH) {
			case 0:
				/* channel 0: NTC */
				adctotemp(0);
				ADCON0bits.ADON = 0;
				ADPCH = 1;
				ADCON0bits.ADON = 1;
				break;
			case 1:
				/* channel 1: NTC */
				adctotemp(1);
				ADCON0bits.ADON = 0;
				ADPCH = 4;
				ADCON0bits.ADON = 1;
				break;
			case 4:
				/* channel 4: NTC */
				adctotemp(2);
				ADCON0bits.ADON = 0;
				ADPCH = 0;
				/* don't set ADON, will do on next second */
				break;
			default:
				printf("unknown channel 0x%x\n", ADCON0);
			}
		}
#endif

		if (softintrs.bits.int_10hz) {
			softintrs.bits.int_10hz = 0;
#ifdef USEPAC
			/* read voltage values */
			for (c = 0; c < 4; c++) {
				pac_vbus_t pac_vbus;
				if ((pac_ctrl.ctrl_chan_dis & (8 >> c)) != 0)
					continue;
				if (i2c_readreg_be(PAC_I2C_ADDR,
				    PAC_VBUS1_AVG + c,
				    &pac_vbus, sizeof(pac_vbus)) ==
				    sizeof(pac_vbus))
					voltages_acc_cur[c] += pac_vbus.vbus_s;
				else
					printf("read v[%d] fail\n", c);
			}
#endif /* USEPAC */
			counter_1hz--;
#ifdef USEPAC
			switch(counter_1hz) {
			case 6:
				/*
				 * get new values in registers and reset
				  * accumulator. Also freeze software voltage
				  * accumulator.
				  */
				if (i2c_writecmd(PAC_I2C_ADDR,
				    PAC_REFRESH) == 0)
					printf("PAC_REFRESH fail\n");
				for (c = 0; c < 4; c++) {
					voltages_acc[c] = voltages_acc_cur[c];
					l600_voltages_acc[c] +=
					    voltages_acc_cur[c];
					voltages_acc_cur[c] = 0;
				}
				SIDINC(sid);
				break;
			case 5:
				read_pac_channel();
				/* FALLTHROUGH */
			case 4:
			case 3:
			case 2:
				send_batt_status(counter_1hz - 2);
				/* FALLTHROUGH */
			default:
				/* get new values for next voltage read */
				if (i2c_writecmd(PAC_I2C_ADDR,
				    PAC_REFRESH_V) == 0)
					printf("PAC_REFRESH_V fail\n");
			}
#endif /* USEPAC */

			if (counter_1hz == 0) {
				counter_1hz = 10;
				seconds++;
				if (seconds == 600) {
					// USELOG update_log();
					seconds = 0;
				}
				// USEADC  ADCON0bits.ADON = 1; /* start a new cycle */
			} else {
			}
			if (ADCON0bits.ADON)
				ADCON0bits.GO = 1;
			if (!NCANOK && nmea2000_status == NMEA2000_S_OK) {
				uint16_t ticks, tmrv;

				tmrv = timer0_read();
				ticks = tmrv - poll_count;
				if (ticks > TIMER0_5MS) {
					poll_count = tmrv;
					nmea2000_poll(ticks / TIMER0_1MS);
				}
				if (nmea2000_status != NMEA2000_S_OK) {
					printf("lost CAN bus %d\n",
					    ticks);
				}
			}
		}
		if (PIR4bits.U1RXIF && (U1RXB == 'r'))
			break;
		if (softintrs.byte == 0)
			SLEEP();
	}
	while ((c = getchar()) != 'r') {
		printf("resumed %u\n", timer0_read());
		goto again;
	}
	WDTCON0bits.SEN = 0;
	printf("returning\n");
	while (!PIR4bits.U1TXIF) {
		; /* wait */ 
	}
	RESET();
	return 0;
}

unsigned int
timer0_read(void)
{
	unsigned int value;

	/* timer0_value = TMR0L | (TMR0H << 8), reading TMR0L first */
	di();
	asm("movff TMR0L, timer0_read@value");
	asm("movff TMR0H, timer0_read@value+1");
	ei();
	return value;
}

#ifdef USE_TIMER2
void __interrupt(__irq(TMR2), __high_priority, base(IVECT_BASE))
irqh_timer2(void)
{
	PIR3bits.TMR2IF = 0;
	if (--counter_10hz == 0) {
		counter_10hz = 25;
		softintrs.bits.int_10hz = 1;
	}			
}
#else
void __interrupt(__irq(TU16A), __high_priority, base(IVECT_BASE))
irqh_tu16a(void)
{
	TU16ACON1bits.CLR = 1;
	TU16ACON1bits.PRIF = 0;
	softintrs.bits.int_10hz = 1;
}
#endif
